PROC 0
/*   CLIST TO ALLOCATE THE ISPF / RFE / REVIEW PROFILE DATA SET
/*   - THERE IS PROBABLY NO NEED TO RUN THIS AT ALL IF YOU HAVE
/*     ISPF FUNCTIONING CORRECTLY, BUT IT IS SHIPPED TO DISPLACE
/*     OLDER VERSIONS WHICH ARE NO LONGER SUITABLE
SET PROFDSN = &SYSUID..ISP.PROF
IF &SYSDSN('&PROFDSN') = OK THEN ALLOC F(ISPPROF) DA('&PROFDSN')
ELSE DO
CONTROL NOMSG
FREE ATTR(PROFATTR)
CONTROL MSG
ATTR PROFATTR RECFM(F B) LRECL(80) BLKSIZE(3120)
ALLOC F(ISPPROF) DA('&PROFDSN') NEW USING(PROFATTR) DIR(10) SP(2 2) CYL
FREE ATTR(PROFATTR)
END
